{
  "dataframe_split": {
    "columns": [
      "review"
    ],
    "data": [
      [
        "the tortuous emotional impact is degrading, whether adult or adolescent the personal values shown in this movie belong in a bad psychodrama if anywhere at all. This movie has a plot, but it is all evil from start to end. This is no way for people to act and degrades both sexes all the way through the movie. teen killing - bad preteen sex - bad emotional battering - bad animal cruelty - bad psychological torture - bad parental neglect - bad the only merit if any is the excellent color shots of contrasting red, blond and green leaves a bad feeling for anyone that respects life and peace, what a bad mistake to make, or to watch... it is UGLY"
      ],
      [
        "Anyone who knows anything about evolution wouldn't even need to see the film to say \"fake\". \"it's never been disproved\" also is a weak argument. Saying the universe was created by a giant hippo cannot be disproved. Although, to be fair, it does seem like the only people who do believe are the same people who open email attachments from people they don't know or give their bank details to a dude in Zambia. No bones of any primates are have been found in the United States or Canada. There is also a good reason why legitimate scientists don't bother studying this. The same argument goes for the Loch Ness monster, ghosts and god."
      ],
      [
        "I'm glad I rented this movie for one reason: its shortcomings made me want to read Allende's book and get the full story. <br /><br />Pros: the movie is beautiful, the period is depicted well and consistently (to the best of my knowledge), and Meryl and Glenn do good jobs.<br /><br />Cons: This is the worst acting job I've ever seen from Jeremy Irons--I kept wondering if something was wrong with his mouth. (And I hate the terribly English way he says \"Transito.\") Winona Ryder does nothing believable except look young and idealistic. Most of the other performances are OK, but so few things hang together in the character arcs and the relationship development that I was frustrated and angry well before the end. <br /><br />I'm very curious now whether this movie is typical of Bille August's work. I may have to drop another couple of bucks to rent Smilla's Sense of Snow."
      ],
      [
        "Yes, the votes are in. This film may very well be the Plan 9 From Outer Space for our generation. But whereas Ed Wood's film, for all its flaws, retains a certain charm despite it all, this film defines the word \"charmless\" to the nth degree. In fact, I'd suggest to the editors of the Oxford English Dictionary to cite this movie as a key example defining the that word in the next update to the dictionary.<br /><br />Carrot Top is a performer of such abysmal ability that normally rational people that I know once they hear his name become homicidal maniacs dedicated to wanting to kill Mr. Top as soon as possible. Indeed, if one goes to Amazon.com and look at customer reviews for Carrot Top's movie and other performance DVD, one will find several that could be construed as death threats to Mr. Top.<br /><br />One other curious fact about this film, I recall that Mike Nelson, the head writer for MST 3000, in his book Mike's Mega Cheese about movies, good and bad, said he saw this film and shortly afterwords couldn't recall a thing about it, including the title. Obviously Mike was suffering a classic reaction to trauma. Viewing this atrocity was so soul numbing, Mike Nelson had to block it from his mind. (Evidently, in a later chapter in his book, Mike Nelson had recovered his memeory of this film. From the review he offers, Mike Nelson was definitely not grateful for the recovered memory.)<br /><br />The only comment I offer about the film, and it is not a spoiler, it's simply God's honest truth, it's not funny. None of it is, not even a nanosecond of it is funny."
      ],
      [
        "This mini-series is actually more entertaining than some others with much bigger budgets and grander aspirations. SOTD falls somewhere between \"Kung-Fu\" and \"H R Pufnstuff\" on the entertainment spectrum. If it weren't so long (nearly 3 hours) I think that kids would like it quite a bit. It's got adventure, action, \"cliffhanger scenes\", and not too much romance or other \"icky\" stuff. When you're young, you're not too critical of flexing rubber swords, campy acting, and scenes that are repeated. (At least two scenes are repeated identically in the movie, just as was done in old-time serials in order to bring the audience up to speed.) Finally, kids are usually more accepting of American English dialogue coming out of the mouths of Asian actors. (Not to mention the fact that several of the leading roles are played by non-Asian actors.) <br /><br />I was going to give this movie three stars, but I felt like the director, producers, and cast deserved some extra credit for at least carrying through on the project. This movie is not art, but, like painting your house, it actually took some time, effort, and discipline to get it made.<br /><br />Overall, not a recommended use for your time, but it might keep the kids entertained while traveling in the mini-van.<br /><br />Oh, yeah...hey, IMDb! \"Dialogue\" is the preferred and traditional spelling. Your spell-checking seems to think that \"dialog\" is the proper spelling. While \"dialog\" is acceptable, both Webster's and the OED consider it an alternative form."
      ]
    ]
  }
}